/*
 * 2. * На перегрузку операторов. Описать класс комплексных чисел.
 * Реализовать операцию сложения, умножения, вычитания, проверку на равенство двух комплексных чисел.
 * Переопределить метод ToString() для комплексного числа. Протестировать на простом примере.
 */
Console.WriteLine("Hello, World!");
