/*
 * 1. Создать класс рациональных чисел. В классе два поля – числитель и знаменатель.
 * Предусмотреть конструктор.
 * Определить операторы ==, != (метод Equals()), <, >, <=, >=, +, –, ++, --.
 * Переопределить метод ToString() для вывода дроби.
 * Определить операторы преобразования типов между типом дробь,float, int.
 * Определить операторы *, /, %.
 */

Console.WriteLine("Hello, World!");
